; domain
(define (domain Depot)
;(:requirements :typing :fluents)
(:types place locatable - object
		depot distributor - place
        truck hoist surface - locatable
        pallet crate - surface)

(:predicates (at ?x - locatable ?y - place) 
             (on ?x - crate ?y - surface)
             (in ?x - crate ?y - truck)
             (lifting ?x - hoist ?y - crate)
             (available ?x - hoist)
             (clear ?x - surface)
)

(:functions 
	(load_limit ?t - truck) 
	(current_load ?t - truck) 
	(weight ?c - crate)
	(fuel-cost)
)
	
(:action Drive
:parameters (?x - truck ?y - place ?z - place) 
:precondition (and (at ?x ?y))
:effect (and (not (at ?x ?y)) (at ?x ?z)
		(increase (fuel-cost) 10)))

(:action Lift
:parameters (?x - hoist ?y - crate ?z - surface ?p - place)
:precondition (and (at ?x ?p) (available ?x) (at ?y ?p) (on ?y ?z) (clear ?y))
:effect (and (not (at ?y ?p)) (lifting ?x ?y) (not (clear ?y)) (not (available ?x)) 
             (clear ?z) (not (on ?y ?z)) (increase (fuel-cost) 1)))

(:action Drop 
:parameters (?x - hoist ?y - crate ?z - surface ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (clear ?z) (lifting ?x ?y))
:effect (and (available ?x) (not (lifting ?x ?y)) (at ?y ?p) (not (clear ?z)) (clear ?y)
		(on ?y ?z)))

(:action Load
:parameters (?x - hoist ?y - crate ?z - truck ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (lifting ?x ?y)
		(<= (+ (current_load ?z) (weight ?y)) (load_limit ?z)))
:effect (and (not (lifting ?x ?y)) (in ?y ?z) (available ?x)
		(increase (current_load ?z) (weight ?y))))

(:action Unload 
:parameters (?x - hoist ?y - crate ?z - truck ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (available ?x) (in ?y ?z))
:effect (and (not (in ?y ?z)) (not (available ?x)) (lifting ?x ?y)
		(decrease (current_load ?z) (weight ?y))))

)

; problem
(define (problem depotprob63) (:domain depot)
(:objects
	depot0 depot1 depot2 - depot
	distributor0 distributor1 distributor2 - distributor
	truck0 truck1 - truck
	pallet0 pallet1 pallet2 pallet3 pallet4 pallet5 pallet6 pallet7 pallet8 pallet9 pallet10 pallet11 pallet12 pallet13 - pallet
	crate0 crate1 - crate
	hoist0 hoist1 hoist2 hoist3 hoist4 hoist5 hoist6 - hoist)
(:init
	(at pallet0 depot0)
	(clear pallet0)
	(at pallet1 depot1)
	(clear pallet1)
	(at pallet2 depot2)
	(clear pallet2)
	(at pallet3 distributor0)
	(clear pallet3)
	(at pallet4 distributor1)
	(clear pallet4)
	(at pallet5 distributor2)
	(clear pallet5)
	(at pallet6 distributor1)
	(clear pallet6)
	(at pallet7 depot1)
	(clear pallet7)
	(at pallet8 distributor2)
	(clear pallet8)
	(at pallet9 distributor0)
	(clear pallet9)
	(at pallet10 depot1)
	(clear crate0)
	(at pallet11 distributor0)
	(clear pallet11)
	(at pallet12 depot1)
	(clear crate1)
	(at pallet13 distributor2)
	(clear pallet13)
	(at truck0 distributor0)
	(= (current_load truck0) 0)
	(= (load_limit truck0) 426)
	(at truck1 distributor2)
	(= (current_load truck1) 0)
	(= (load_limit truck1) 290)
	(at hoist0 depot0)
	(available hoist0)
	(at hoist1 depot1)
	(available hoist1)
	(at hoist2 depot2)
	(available hoist2)
	(at hoist3 distributor0)
	(available hoist3)
	(at hoist4 distributor1)
	(available hoist4)
	(at hoist5 distributor2)
	(available hoist5)
	(at hoist6 depot2)
	(available hoist6)
	(at crate0 depot1)
	(on crate0 pallet10)
	(= (weight crate0) 38)
	(at crate1 depot1)
	(on crate1 pallet12)
	(= (weight crate1) 96)
	(= (fuel-cost) 0)
)

(:goal (and
		(on crate0 pallet10)
		(on crate1 pallet5)
	)
)

(:metric minimize (total-time)))

; plan
1. (drive truck0 distributor0 depot1)
   deleted: (at truck0 distributor0)
   added: (at truck0 depot1)
   changed: (fuel-cost) from 0 to 10
   goals met: 1 of 2
2. (lift hoist1 crate1 pallet12 depot1)
   deleted: (at crate1 depot1) (clear crate1) (available hoist1) (on crate1 pallet12)
   added: (lifting hoist1 crate1) (clear pallet12)
   changed: (fuel-cost) from 10 to 11
   goals met: 1 of 2
3. (load hoist1 crate1 truck0 depot1)
   deleted: (lifting hoist1 crate1)
   added: (in crate1 truck0) (available hoist1)
   changed: (current_load truck0) from 0 to 96
   goals met: 1 of 2
4. (drive truck0 depot1 distributor2)
   deleted: (at truck0 depot1)
   added: (at truck0 distributor2)
   changed: (fuel-cost) from 11 to 21
   goals met: 1 of 2
5. (unload hoist5 crate1 truck0 distributor2)
   deleted: (in crate1 truck0) (available hoist5)
   added: (lifting hoist5 crate1)
   changed: (current_load truck0) from 96 to 0
   goals met: 1 of 2
6. (drop hoist5 crate1 pallet5 distributor2)
   deleted: (lifting hoist5 crate1) (clear pallet5)
   added: (available hoist5) (at crate1 distributor2) (clear crate1) (on crate1 pallet5)
   goals met: 2 of 2
